In [1]:
import sqlite3
import pandas as pd

## Connect

In [57]:
conn = sqlite3.connect("Text_Processing.db")
print ("open")

open

In [2]:
conn = sqlite3.connect("Text_Cleaning.db")
print ("opened")

opened

## Create Table

In [58]:
conn.execute('''
    CREATE TABLE Tweet	(
    	Input_Text varchar (255)
        ); 
''')

In [59]:
conn.execute('''
    CREATE TABLE Tweet_Clear	(
    	Output_Text varchar (255)
        ); 
''')

In [3]:
conn.execute('''
    CREATE TABLE Tweet_CSV	(
    	Tweet varchar (255)
        ); 
''')

In [5]:
conn.execute('''
    CREATE TABLE Tweet_CSV_Clear	(
    	Tweet_Clear varchar (255)
        ); 
''')

## Select

In [60]:
Tweet = pd.read_sql_query('SELECT * FROM Tweet',conn)
Tweet.tail()

Empty DataFrame
Columns: [Input_Text]
Index: []

In [61]:
Tweet_Clear = pd.read_sql_query('SELECT * FROM Tweet_Clear',conn)
Tweet_Clear.tail()

Empty DataFrame
Columns: [Output_Text]
Index: []

In [4]:
Tweet_CSV = pd.read_sql_query('SELECT * FROM Tweet_CSV',conn)
Tweet_CSV.tail()

Empty DataFrame
Columns: [Tweet]
Index: []

In [6]:
Tweet_CSV_Clear = pd.read_sql_query('SELECT * FROM Tweet_CSV_Clear',conn)
Tweet_CSV_Clear.tail()

Empty DataFrame
Columns: [Tweet_Clear]
Index: []

## Delete

In [32]:
conn.execute('DELETE FROM Tweet;',)
conn.commit()

In [33]:
conn.execute('DELETE FROM Tweet_Clear;',)
conn.commit()

In [5]:
conn.execute('DELETE FROM Tweet_CSV;',)
conn.commit()

## Close

In [62]:
conn.close()